street_cafes/app/models/restaurant.rb

  def categorize_ls1
    if number_of_chairs < 10
      self.update(category: 'ls1 small')
    elsif number_of_chairs >= 10 && number_of_chairs < 100
      self.update(category: 'ls1 medium')
    else
      self.update(category: 'ls1 large')
---
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "ls1 small"], ["updated_at", "2020-11-15 22:46:13.977333"], ["id", 5]]
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "ls1 medium"], ["updated_at", "2020-11-15 22:46:13.950611"], ["id", 1]]
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "ls1 large"], ["updated_at", "2020-11-15 22:46:14.095898"], ["id", 53]]

  def categorize_ls2(prefix)
    fifty_percentile = Restaurant.where("post_code like ?", "%#{prefix}%").percentile(:number_of_chairs, 0.50)
    if number_of_chairs < fifty_percentile
      self.update(category: 'ls2 small')
    else
      self.update(category: 'ls2 large')
---
SELECT PERCENTILE_CONT(0.5) WITHIN GROUP (ORDER BY "restaurants"."number_of_chairs") FROM "restaurants" WHERE (post_code like '%LS2%')
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "ls2 small"], ["updated_at", "2020-11-15 22:46:14.012517"], ["id", 18]]
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "ls2 large"], ["updated_at", "2020-11-15 22:46:13.965182"], ["id", 2]]

  def self.categorize_restaurants
    restaurants = Restaurant.all
    restaurants.map do |restaurant|
      prefix = restaurant.post_code.split(" ")[0]
      if prefix == "LS1"
        restaurant.categorize_ls1
      elsif prefix == "LS2"
        restaurant.categorize_ls2(prefix)
      else
        restaurant.update(category: 'other')
---
SELECT "restaurants".* FROM "restaurants"
UPDATE "restaurants" SET "category" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["category", "other"], ["updated_at", "2020-11-15 22:56:23.040021"], ["id", 49]]

  def self.find_small_restaurants
    Restaurant.where("category like ?", "%small%")
---
SELECT "restaurants".* FROM "restaurants" WHERE ("restaurants"."category" = $1 OR "restaurants"."category" = $2)  [["category", "ls1 small"], ["category", "ls2 small"]]

  def self.to_csv(options = {})
    CSV.generate(options) do |csv_file|
      csv_file << csv_header_row

      all.each do |restaurant|
---
SELECT "restaurants".* FROM "restaurants" WHERE (category like '%small%')

  def self.find_medium_large_restaurants
    Restaurant.where("category like ?", "%medium%").or(Restaurant.where("category like ?", "%large%"))
---
SELECT "restaurants".* FROM "restaurants" WHERE (("restaurants"."category" = $1 OR "restaurants"."category" = $2) OR "restaurants"."category" = $3)  [["category", "ls1 medium"], ["category", "ls1 large"], ["category", "ls2 large"]]

  def self.update_medium_large_restaurant_names
    restaurants = Restaurant.find_medium_large_restaurants
    restaurants.each do |restaurant|
      cat_name = restaurant.category
      original_name = restaurant.name
      new_name = "#{cat_name} #{original_name}"
      restaurant.update(name: new_name)
---
UPDATE "restaurants" SET "name" = $1, "updated_at" = $2 WHERE "restaurants"."id" = $3  [["name", "ls1 medium All Bar One"], ["updated_at", "2020-11-15 02:58:51.208002"], ["id", 74]]